content-org/posts.org
#+hugo_base_dir: ../
#+hugo_level_offset: 1
#+seq_todo: TODO DONE
#+startup: indent
#+hugo_weight: auto
#+hugo_auto_set_lastmod: t
#+hugo_paired_shortcodes: admonition
#+hugo_front_matter_key_replace: description>featuredImage
#+author:
#+hugo_custom_front_matter: :author "Matt Maguire"
#+filetags: @Blog

*** DONE Japanese Electronic Dictionary (Casio XD-G9850) :Languages:Japanese:
:PROPERTIES:
:CUSTOM_ID: xd-g9850
:EXPORT_FILE_NAME: index.md
:EXPORT_HUGO_BUNDLE: 20250315-denshijisho_xd-g9850
:EXPORT_DATE: 2025-03-15
:EXPORT_HUGO_MENU:
:EXPORT_DESCRIPTION: 20250315-xd_g9850.jpg
:END:
When I was working in Japan, I took the opportunity to buy a Japanese Electronic dictionary (電子辞書, or denshi jisho). I went to the BIC Camera store in Akihabara, and bought a Casio EX-word dataplus 10 model XD-G9850 denshi jisho, which includes specialised dictionaries for Maths and Science.

**** Why Use a Dedicated Dictionary?
Why use a dedicated japanese dictionary instead of an app on a smart phone?
***** Pros
- Has a long battery life (>120 hours), whereas a smart phone app will quickly drain your phone's battery
- AA cells are readily available, and no need to wait for them to be recharged.
- Can also power the dictionary via USB, and can use Eneloop rechargable batteries.
- Can handwrite kanji, and the recognition is quite forgiving.

  You can get the dictionary to automatically recognise what you have written when you stop writing, or if you are hesitant when writing Kanji, you can set the recognition so you trigger it manually once you have finished writing the kanji.
- By handwriting kanji instead of using a camera to scan and recognise them, it helps you to get a better "feel" for the structure of the kanji, making it easier to commit them to memory.
- Can study Japanese without distractions from other smart phone apps/social media.
- is optimised to allow fast lookup of words, and can easily look up unknown words in a definition using the "jump" (ジャンプ) and "back" (戻る) buttons.
- has lots of example sentences in both Japanese and English to show how words are used.
***** Cons
- Need to carry around an extra device
- it doesn't have a cemera to analyse written kanji -- you need to handwrite the kanji yourself (which is actually good practice for you)
- it doesn't have natural language processing, which means you need to be able to break a sentence up into individual words yourself.
- The user interface is all in Japanese, and the device is optimised for Japanese people trying to learn English rather than English speakers trying to learn Japanese.
**** Key Kanji
Since user interface is all in Japanese, you need to be able to at least read /hiragana/ and /katakana/ to be able to use the dictionary. Some basic knowledge of /kanji/ is also helpful, but once you understand the basic lookup function, you can look up any kanji you don't know. Some kanji that are particularly important are:

|-------+-------------------+-----------------------------------------------------------------------------|
| kanji | pronunciation     | meaning                                                                     |
|-------+-------------------+-----------------------------------------------------------------------------|
| 和    | わ (wa)           | Japanese (this is the same "wa" you see in "wagyu", or Japanese-style beef) |
| 英    | えい  (ei)        | English                                                                     |
| 戻る  | もどる (modoru)    | Go back                                                                     |
| 削除  | さくじょ (sakujo)  | Delete (backspace)                                                          |
| 決定  | けってい  (kettei) | Enter key (literally, to decide)                                            |
|-------+-------------------+-----------------------------------------------------------------------------|

So, looking at the first two kanji, if a dictionary has 「英和」 in its name, it is an English-to-Japanese dictionary, and 「和英」 would be a Japanese-to-English dictionary.

**** Available Dictionaries/Modes
Along the top row of the keyboard are some shortcut keys that give you quick access to various dictionaries and modes. Every button has two modes, so that is you press the button once you get the button's primary mode, and if you press it again you'll get its secomdary mode.

By default, these shortcut buttons take you to the following dictionaries:

|-----------+------------------------------------+---------------------------------------------------------------------------|
| Button    | Dictionary/Mode                    | Notes                                                                     |
|-----------+------------------------------------+---------------------------------------------------------------------------|
| 大辞泉     | Digital Daijisen                   | Japanese dictionary Supporting reverse lookup and handwritten Kanji       |
| 国語      | Meikyou Japanese Dict              | 2nd edition, supports recorded native pronunciation and handwritten kanji |
|-----------+------------------------------------+---------------------------------------------------------------------------|
| 百科      | Encyclopedia Nipponica             | Japanese encylcopedia supporting handwritten kanji                        |
| 漢和      | New Japanese Kanji Dict            | Search for kanji/phrases by handwriting, or for kanji by strokes/reading  |
|-----------+------------------------------------+---------------------------------------------------------------------------|
| リーダーズ | Leader's E-J Dict                  | Includes "Plus" dictionary with native English pronunciations.            |
| 英和大     | Genius E-J Big Dict                | Include example sentences                                                 |
|-----------+------------------------------------+---------------------------------------------------------------------------|
| 英 和     | Genius E-J Dict                    | 5th edition                                                               |
| 和 英     | Genius J-E Kanji Dict              | 3rd edition                                                               |
|-----------+------------------------------------+---------------------------------------------------------------------------|
| 理化学     | J-E Physics and Chemictry Dict     |                                                                           |
| 理化学和英 | E-J Physics and Chemistry Dict     |                                                                           |
|-----------+------------------------------------+---------------------------------------------------------------------------|
| 学習 1     | TOEIC Practice Tests               | for learning English                                                      |
| 学習 2     | Royal English Grammar              | for learning Elglish                                                      |
|-----------+------------------------------------+---------------------------------------------------------------------------|
| メニュー   | Menu                               | Full list of available dicts.                                             |
| トレジム   | Training Gym                       | for learning English                                                      |
|-----------+------------------------------------+---------------------------------------------------------------------------|
| ホーム     | Home button                        | Useful for searching all the dictionaries in one go.                      |
|-----------+------------------------------------+---------------------------------------------------------------------------|

There are a number of other dictionaries that may be interesting, such as:
- a /katakana/ dictionary of foreign loan words
- travel dictionaries from Japanese to English, Spanish, German, French, Italian, (Mandarin) Chinese, Korean, Thai, Russian, Portugese, Tagolog, Turkish, Vietnamese, Indonesian, Malay and Taiwanese.
- Oxford Avdanced Learner's Monolingual English dictionary.

It may be useful to use the google translate camera feature on your smartphone to explore the full list disctionaries available via the "menu" button.

**** Further Info
For more info on using this device, there is available an English-language quick reference sheet, which I attach below:

#+hugo: {{< embed-pdf url="20250315-qrg-xd_g9850.pdf" >}}

The main userguide is available in Japanese only from the [[https://www.casio.com/jp/support/exword/][Casio Japanese support website]] -- just type in the model number of your device.

Hopefully though between the english quick reference guide and the info here, you are in a good position to start making use of this useful device with your study of the Japanese language.

